import dash
from dash import html, dcc
import dash_bootstrap_components as dbc
from sidebar2 import *

dash.register_page(
    __name__,
    path='/trat',
    title='ข้อมูลทั่วไปจังหวัดตราด',
    name='ข้อมูลทั่วไปจังหวัดตราด'
)


MyContent="""
### ที่ตั้ง
จังหวัดตราดตั้งอยู่ภาคตะวันออกของประเทศไทยห่างจาก กรุงเทพฯ 315 กม. มีเนื้อที่ประมาณ 2,819 ตร.กม. หรือ ประมาณ 761,875 ไร่ และเป็นพื้นที่ตามเขตปกครองทางทะเล ประมาณ 7,257 ตร.กม. มีอาณา เขตติดต่อกับจังหวัดใกล้เคียง และประเทศเพื่อนบ้าน ดังนี้ ทิศเหนือ ติดต่อกับ อำเภอขลุง จังหวัด จันทบุรี และ ประเทศ กัมพูชา ทิศใต้ ติดต่อกับ อ่าวไทย และ น่านน้ำทะเล ระเทศกัมพูชา ทิศตะวันออก ติดต่อกับ ประเทศกัมพูชา มีทิวเขาบรรทัด ป็นแนวกั้น เขตแดน ทิศตะวันตก ติดต่อกับ อำเภอขลุง จังหวัดจันทบุรี
### ลักษณะภูมิประเทศ 
มีอาณาบริเวณทั้งที่เป็นแผ่นดิน และ พื้นน้ำ ประกอบด้วย เทือกเขาสูงอุดม ด้วยป่าเบญจพรรณ และป่าดิบทาง ส่วนบริเวณหมู่เกาะต่างๆ ทางด้านใต้ ภูมิประเทศส่วนใหญ่เป็นภูเขาสูงเช่นเดียวกัน ตอนเหนือ เป็นที่ราบบริเวณภูเขา ตอนกลาง เป็นที่ราบ ลุ่มน้ำที่อุดมสมบูรณ์ แล้วลาดลงเป็นที่ราบชายฝั่งทะเล สภาพภูมิประเทศที่ปรากฏจึงแบ่ง เป็น 4 ลักษณะ
1. บริเวณที่ราบลุ่มแม่น้ำ เหมาะ สำหรับทำนาข้าว และปลูกผลไม้
2. ที่ราบบริเวณภูเขา บริเวณนี้ มีพื้นที่กว้างขวางมาก เป็นพื้นที่ที่เหมาะสม แก่การทำสวนผลไม้ ยางพารา และ สับปะรด
3. ที่สูงบริเวณภูเขา บริเวณที่เป็นเกาะต่างๆ ซึ่งส่วนมาก มีสภาพเป็นพื้นที่ป่าไม้
4. ที่ราบต่ำชายฝั่งทะเล บริเวณ พื้นที่แห่งนี้เป็นป่าชายเลน อย่างหนาแน่น และ ยังเป็นสถานที่เลี้ยงสัตว์น้ำ บางชนิดด้วย

###### Ref:
###### https://www.trat.go.th
"""


content = html.Div(id='page-content',children=[
            html.H1('ข้อมูลทั่วไปจังหวัดตราด',className='p-10 bg-info rounded-3 text-center'),
        html.Hr(),
        html.H2('ข้อมูลทั่วไปจังหวัดตราด',className='p-3 bg-light rounded-3'),
        html.Br(),
        html.Img(src=dash.get_asset_url('trat1.png'), className='center'), 
        dcc.Markdown(MyContent, mathjax=True),
        html.Img(src=dash.get_asset_url('trat2.jpg')),
        #dcc.Markdown(MyContent,className='p-3 bg-light rounded-3')
        
        ],style=CONTENT_STYLE)
layout = html.Div([sidebar,content])
